"""
# Задача 1: Методы списка +1

Напишите 3 функции, каждая из которых будет выполнять определённые действия со
списком целых чисел.

1. get_central_element(numbers) - возвращает центральный элемент списка.
Если количество элементов в списке четное - возвращает два центральных
элемента в виде кортежа.
2. get_latest_sorted_items(numbers) - возвращает два последних элемента
отсортированного по возрастанию списка, в виде кортежа.
Элементы должны возвращаться в том порядке, в котором они были отсортированы.
3. check_hundred(numbers) - возвращает "YES", если список содержит элементы
100 и -100, иначе возвращает "NO". Этот пункт нужно реализовать с
использованием тернарного оператора.

> Гарантируется, что количество элементов в списке больше одного.

Под блоком if __name__ == '__main__':
1. Получите список от пользователя (каждый элемент списка вводится через пробел
на одной строке)
2. Проинициализируйте переменную numbers - список.
3. Приведите элементы списка к типу int.
4. Выполните функции, передав им нужные аргументы, и распечатайте результат
вызовов функций.

Добавьте докстринги (описание функций) и аннотации типов (указание типов
параметров и возвращаемых значений) для каждой функции.
"""
